In [2]:
import pandas as pd
import numpy as np
from pymongo import MongoClient
import os

In [4]:
MONGODB_URL_KEY = "MONGODB_URL"
os.getenv(MONGODB_URL_KEY)

'mongodb+srv://karanbgsr_db_user:karanbgsr_db_user@clusterkaran.pgws5dr.mongodb.net/?appName=ClusterKaran'

In [2]:
df = pd.read_csv("EasyVisa.csv")

In [3]:
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  object
 1   continent              25480 non-null  object
 2   education_of_employee  25480 non-null  object
 3   has_job_experience     25480 non-null  object
 4   requires_job_training  25480 non-null  object
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  object
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  object
 10  full_time_position     25480 non-null  object
 11  case_status            25480 non-null  object
dtypes: float64(1), int64(2), object(9)
memory usage: 2.3+ MB

In [6]:
df.describe()

       no_of_employees   yr_of_estab  prevailing_wage
count     25480.000000  25480.000000     25480.000000
mean       5667.043210   1979.409929     74455.814592
std       22877.928848     42.366929     52815.942327
min         -26.000000   1800.000000         2.136700
25%        1022.000000   1976.000000     34015.480000
50%        2109.000000   1997.000000     70308.210000
75%        3504.000000   2005.000000    107735.512500
max      602069.000000   2016.000000    319210.270000

In [5]:
numeric_features = [feature for feature in df.columns if df[feature].dtype != 'O']
categorical_features = [feature for feature in df.columns if df[feature].dtype == 'O']

In [6]:
print(numeric_features)
print(categorical_features)

['no_of_employees', 'yr_of_estab', 'prevailing_wage']
['case_id', 'continent', 'education_of_employee', 'has_job_experience', 'requires_job_training', 'region_of_employment', 'unit_of_wage', 'full_time_position', 'case_status']

In [10]:
for feature in categorical_features:
    print(round(df[feature].value_counts(normalize=True)*100, 2))

case_id
EZYV01       0.0
EZYV02       0.0
EZYV03       0.0
EZYV04       0.0
EZYV05       0.0
            ...
EZYV25476    0.0
EZYV25477    0.0
EZYV25478    0.0
EZYV25479    0.0
EZYV25480    0.0
Name: proportion, Length: 25480, dtype: float64
continent
Asia             66.17
Europe           14.65
North America    12.92
South America     3.34
Africa            2.16
Oceania           0.75
Name: proportion, dtype: float64
education_of_employee
Bachelor's     40.16
Master's       37.81
High School    13.42
Doctorate       8.60
Name: proportion, dtype: float64
has_job_experience
Y    58.09
N    41.91
Name: proportion, dtype: float64
requires_job_training
N    88.4
Y    11.6
Name: proportion, dtype: float64
region_of_employment
Northeast    28.24
South        27.54
West         25.85
Midwest      16.90
Island        1.47
Name: proportion, dtype: float64
unit_of_wage
Year     90.12
Hour      8.47
Week      1.07
Month     0.35
Name: proportion, dtype: float64
full_time_position
Y    89.38
N    10.62
Name: proportion, dtype: float64
case_status
Certified    66.79
Denied       33.21
Name: proportion, dtype: float64

In [5]:
df_test = pd.DataFrame({'SKU':['A','A','A','A','A','A','A','A','A'],'Sales':[10,5,1,2,100,1,4,3,100]})

In [6]:
def moving_avg(ma =3, df = df):
    for i in range(ma):
        df = df.assign(**{f"Lead_{i+1}" : df['Sales'].shift(i+1)})
    return df

In [ ]:
df_output = moving_avg(3,df =df_test )
display(df_output)

df_output['ma3'] = df_output[['Lead_1','Lead_2','Lead_3']].mean(axis=1,skipna=True)
display(df_output)

  SKU  Sales  Lead_1  Lead_2  Lead_3
0   A     10     NaN     NaN     NaN
1   A      5    10.0     NaN     NaN
2   A      1     5.0    10.0     NaN
3   A      2     1.0     5.0    10.0
4   A    100     2.0     1.0     5.0
5   A      1   100.0     2.0     1.0
6   A      4     1.0   100.0     2.0
7   A      3     4.0     1.0   100.0
8   A    100     3.0     4.0     1.0

  SKU  Sales  Lead_1  Lead_2  Lead_3        ma3
0   A     10     NaN     NaN     NaN        NaN
1   A      5    10.0     NaN     NaN        NaN
2   A      1     5.0    10.0     NaN        NaN
3   A      2     1.0     5.0    10.0   5.333333
4   A    100     2.0     1.0     5.0   2.666667
5   A      1   100.0     2.0     1.0  34.333333
6   A      4     1.0   100.0     2.0  34.333333
7   A      3     4.0     1.0   100.0  35.000000
8   A    100     3.0     4.0     1.0   2.666667

In [12]:
display(df)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [13]:
df.groupby('case_status').count()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position
case_status,,,,,,,,,,,
Certified,17018,17018,17018,17018,17018,17018,17018,17018,17018,17018,17018
Denied,8462,8462,8462,8462,8462,8462,8462,8462,8462,8462,8462

In [15]:
df.groupby('case_status')['no_of_employees'].agg(['sum','mean'])

                  sum         mean
case_status
Certified    98823835  5807.018157
Denied       45572426  5385.538407

In [16]:
df.groupby(['continent','has_job_experience'])['case_status'].count()

continent      has_job_experience
Africa         N                      217
               Y                      334
Asia           N                     7071
               Y                     9790
Europe         N                     1576
               Y                     2156
North America  N                     1348
               Y                     1944
Oceania        N                       89
               Y                      103
South America  N                      377
               Y                      475
Name: case_status, dtype: int64

In [22]:
df.groupby(['continent','has_job_experience'])['case_status'].value_counts(normalize=True)*100

continent      has_job_experience  case_status
Africa         N                   Certified      61.290323
                                   Denied         38.709677
               Y                   Certified      79.041916
                                   Denied         20.958084
Asia           N                   Certified      53.655777
                                   Denied         46.344223
               Y                   Certified      73.728294
                                   Denied         26.271706
Europe         N                   Certified      76.205584
                                   Denied         23.794416
               Y                   Certified      81.447124
                                   Denied         18.552876
North America  N                   Denied         52.448071
                                   Certified      47.551929
               Y                   Certified      71.810700
                                   Denied         28.189300
Oceania        N                   Certified      57.303371
                                   Denied         42.696629
               Y                   Certified      68.932039
                                   Denied         31.067961
South America  N                   Denied         53.846154
                                   Certified      46.153846
               Y                   Certified      67.157895
                                   Denied         32.842105
Name: proportion, dtype: float64

In [23]:
df.groupby(['continent','has_job_experience']).agg({'case_status':'count',
                                                    'prevailing_wage':'mean'})

                                  case_status  prevailing_wage
continent     has_job_experience
Africa        N                           217     74650.924410
              Y                           334     79228.841989
Asia          N                          7071     81189.910550
              Y                          9790     78353.527348
Europe        N                          1576     60994.466645
              Y                          2156     59001.168842
North America N                          1348     67231.912663
              Y                          1944     68644.909837
Oceania       N                            89     70866.088242
              Y                           103     80425.429870
South America N                           377     59549.633885
              Y                           475     60733.360406